driver-tests/bpelse/scalability/ScalabilityJbi/test/TestCase5/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:OutputMessage xmlns:someNS="http://enterprise.netbeans.org/bpel/TroubleTicketWrapper">
      <ns0:createTroubleTicketByValueRequest xmlns:ns0="http://java.sun.com/products/oss/xml/TroubleTicket">
        <ns0:troubleTicketValue>
          <ns0:troubleTicketKey>
            <comm:applicationContext xmlns:comm="http://java.sun.com/products/oss/xml/Common">
              <comm:factoryClass>?string?</comm:factoryClass>
              <comm:url>?http://www.any.com/verrantque/temperat?</comm:url>
              <comm:systemProperties>
                <comm:property>
                  <comm:name>?string?</comm:name>
                  <comm:value>?string?</comm:value>
                </comm:property>
              </comm:systemProperties>
            </comm:applicationContext>
            <comm:applicationDN xmlns:comm="http://java.sun.com/products/oss/xml/Common">?string?</comm:applicationDN>
            <comm:type xmlns:comm="http://java.sun.com/products/oss/xml/Common">?string?</comm:type>
            <ns0:primaryKey>?string?</ns0:primaryKey>
          </ns0:troubleTicketKey>
          <ns0:accountOwner>
            <ns0:email>?string?</ns0:email>
            <ns0:fax>?string?</ns0:fax>
            <ns0:location>
              <tro1:addressInfo xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:addressInfo>
            </ns0:location>
            <ns0:name>?string?</ns0:name>
            <ns0:number>?string?</ns0:number>
            <ns0:organizationName>?string?</ns0:organizationName>
            <ns0:phone>?string?</ns0:phone>
            <ns0:responsible>?string?</ns0:responsible>
            <ns0:sMSAddress>?string?</ns0:sMSAddress>
          </ns0:accountOwner>
          <ns0:activityDurationList>
            <comm:modifier xmlns:comm="http://java.sun.com/products/oss/xml/Common">?ADD?</comm:modifier>
            <ns0:activityDurations>
              <tro1:item xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">
                <tro1:baseActivityType>?string?</tro1:baseActivityType>
                <tro1:billable>?true?</tro1:billable>
                <tro1:duration>
                  <tro1:years>?200?</tro1:years>
                  <tro1:months>?11?</tro1:months>
                  <tro1:days>?31?</tro1:days>
                  <tro1:hours>?23?</tro1:hours>
                  <tro1:minutes>?59?</tro1:minutes>
                  <tro1:seconds>?59?</tro1:seconds>
                  <tro1:msecs>?200?</tro1:msecs>
                </tro1:duration>
              </tro1:item>
            </ns0:activityDurations>
          </ns0:activityDurationList>
          <ns0:additionalTroubleInfoList>
            <comm:item xmlns:comm="http://java.sun.com/products/oss/xml/Common">?string?</comm:item>
          </ns0:additionalTroubleInfoList>
          <ns0:afterHoursRepairAuthority>true</ns0:afterHoursRepairAuthority>
          <ns0:authorizationList>
            <ns0:item>
              <ns0:baseActivityType>?string?</ns0:baseActivityType>
              <ns0:authPerson>
                <tro1:email xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:email>
                <tro1:fax xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:fax>
                <tro1:location xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">
                  <tro1:addressInfo>?string?</tro1:addressInfo>
                </tro1:location>
                <tro1:name xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:name>
                <tro1:number xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:number>
                <tro1:organizationName xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:organizationName>
                <tro1:phone xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:phone>
                <tro1:responsible xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:responsible>
                <tro1:sMSAddress xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:sMSAddress>
              </ns0:authPerson>
              <ns0:authTime>2003-08-08T17:18:37-07:00</ns0:authTime>
              <ns0:requestState>?DENIED?</ns0:requestState>
            </ns0:item>
          </ns0:authorizationList>
          <ns0:cancelRequestedByCustomer>false</ns0:cancelRequestedByCustomer>
          <ns0:clearancePerson>
            <ns0:email>?string?</ns0:email>
            <ns0:fax>?string?</ns0:fax>
            <ns0:location>
              <tro1:addressInfo xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:addressInfo>
            </ns0:location>
            <ns0:name>?string?</ns0:name>
            <ns0:number>?string?</ns0:number>
            <ns0:organizationName>?string?</ns0:organizationName>
            <ns0:phone>?string?</ns0:phone>
            <ns0:responsible>?string?</ns0:responsible>
            <ns0:sMSAddress>?string?</ns0:sMSAddress>
          </ns0:clearancePerson>
          <ns0:closeOutNarr>string</ns0:closeOutNarr>
          <ns0:baseCloseOutVerification>string</ns0:baseCloseOutVerification>
          <ns0:customer>
            <ns0:email>?string?</ns0:email>
            <ns0:fax>?string?</ns0:fax>
            <ns0:location>
              <tro1:addressInfo xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:addressInfo>
            </ns0:location>
            <ns0:name>?string?</ns0:name>
            <ns0:number>?string?</ns0:number>
            <ns0:organizationName>?string?</ns0:organizationName>
            <ns0:phone>?string?</ns0:phone>
            <ns0:responsible>?string?</ns0:responsible>
            <ns0:sMSAddress>?string?</ns0:sMSAddress>
          </ns0:customer>
          <ns0:customerRoleAssignmentList>
            <ns0:item>
              <ns0:baseRole>?string?</ns0:baseRole>
              <ns0:contactPerson>
                <tro1:email xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:email>
                <tro1:fax xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:fax>
                <tro1:location xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">
                  <tro1:addressInfo>?string?</tro1:addressInfo>
                </tro1:location>
                <tro1:name xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:name>
                <tro1:number xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:number>
                <tro1:organizationName xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:organizationName>
                <tro1:phone xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:phone>
                <tro1:responsible xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:responsible>
                <tro1:sMSAddress xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:sMSAddress>
              </ns0:contactPerson>
            </ns0:item>
          </ns0:customerRoleAssignmentList>
          <ns0:customerTroubleNum>?string?</ns0:customerTroubleNum>
          <ns0:dialog>?string?</ns0:dialog>
          <ns0:escalationList>
            <comm:modifier xmlns:comm="http://java.sun.com/products/oss/xml/Common">?NONE?</comm:modifier>
            <ns0:escalations>
              <ns0:item>
                <tro1:escPerson xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">
                  <tro1:email>?string?</tro1:email>
                  <tro1:fax>?string?</tro1:fax>
                  <tro1:location>
                    <tro1:addressInfo>?string?</tro1:addressInfo>
                  </tro1:location>
                  <tro1:name>?string?</tro1:name>
                  <tro1:number>?string?</tro1:number>
                  <tro1:organizationName>?string?</tro1:organizationName>
                  <tro1:phone>?string?</tro1:phone>
                  <tro1:responsible>?string?</tro1:responsible>
                  <tro1:sMSAddress>?string?</tro1:sMSAddress>
                </tro1:escPerson>
                <tro1:escTime xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">2018-12-28T11:51:14-08:00</tro1:escTime>
                <tro1:orgLevel xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?NOESCALATION?</tro1:orgLevel>
                <tro1:requestPerson xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">
                  <tro1:email>?string?</tro1:email>
                  <tro1:fax>?string?</tro1:fax>
                  <tro1:location>
                    <tro1:addressInfo>?string?</tro1:addressInfo>
                  </tro1:location>
                  <tro1:name>?string?</tro1:name>
                  <tro1:number>?string?</tro1:number>
                  <tro1:organizationName>?string?</tro1:organizationName>
                  <tro1:phone>?string?</tro1:phone>
                  <tro1:responsible>?string?</tro1:responsible>
                  <tro1:sMSAddress>?string?</tro1:sMSAddress>
                </tro1:requestPerson>
                <tro1:requestState xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?REQUESTED?</tro1:requestState>
              </ns0:item>
            </ns0:escalations>
          </ns0:escalationList>
          <ns0:baseInitiatingMode>?string?</ns0:baseInitiatingMode>
          <ns0:maintServiceCharge>false</ns0:maintServiceCharge>
        </ns0:troubleTicketValue>
      </ns0:createTroubleTicketByValueRequest>
      <ns0:createTroubleTicketByValueResponse xmlns:ns0="http://java.sun.com/products/oss/xml/TroubleTicket">
        <ns0:troubleTicketKey>
          <com:applicationContext xmlns:com="http://java.sun.com/products/oss/xml/Common">
            <com:factoryClass>?string?</com:factoryClass>
            <com:url>?http://www.any.com/verrantque/temperat?</com:url>
            <com:systemProperties>
              <com:property>
                <com:name>?string?</com:name>
                <com:value>?string?</com:value>
              </com:property>
            </com:systemProperties>
          </com:applicationContext>
          <com:applicationDN xmlns:com="http://java.sun.com/products/oss/xml/Common">?string?</com:applicationDN>
          <com:type xmlns:com="http://java.sun.com/products/oss/xml/Common">?string?</com:type>
          <tro1:primaryKey xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:primaryKey>
        </ns0:troubleTicketKey>
      </ns0:createTroubleTicketByValueResponse>
      <testOptions xmlns="">
        <messageId>3</messageId>
        <bpelWaitDuration>P0M0DT0H0M5S</bpelWaitDuration>
        <partnerWaitDuration>P0M0DT0H0M5S</partnerWaitDuration>
        <assignActivityLoad>MEDIUM</assignActivityLoad>
      </testOptions>
    </someNS:OutputMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
